Revit 2026 API

# WaterTintEnableType Enumeration

---

The enumerated type representing the permitted values for the asset property "WaterTintEnable" from the "Water" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WaterTintEnableType
```
```vb
Public Enumeration WaterTintEnableType
```
```cpp
public enum class WaterTintEnableType
```
```fsharp
type WaterTintEnableType
```

| Member name | Value | Description |
| --- | --- | --- |
| Algae | 1 |  |
| Custom | 7 |  |
| Lake | 5 |  |
| Murky | 2 |  |
| Ocean | 6 |  |
| ReflectingPool | 3 |  |
| River | 4 |  |
| Tropical | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace